import { Component } from '@angular/core';

@Component({
  selector: 'app-second-lesson',
  templateUrl: './second-lesson.component.html',
  styleUrls: ['./second-lesson.component.sass']
})
export class SecondLessonComponent {
  items= [
    { title: ' نشاط(1) البالون وتوليد الكهرباء', text: `الخطوات المستخدمة: بالون - قطعة قماش من الصوف محكومة بكمية قليلة من السكر عدا.

لا تخطوات:

قم بنفخ البالون وثبت فوهته بالخيط.

احفظ البالون بقطعة الصوف.

قرب البالون إلى السكر.

تعليقك وتفسيرك [واستنتاجك في كتاب الأنشطة والتدريبات ص 13.

عند حفظ البالون بقطعة الصوف تتشحن الشحنات الساكنة الموجبة وتجذب السكر إليها.`, Img:"../../../../assets/images/Screenshot 2024-06-23 012850.png" },
{ title: ' نشاط(2)   قصاصات الورق والمسطره المشحونه', text: `الأدوات: مسطرة بلاستيكية - قصاصات ورق.

الخطوات:

قرب المسطرة إلى قصاصات الورق.
سجِّل ملاحظاتك في كتاب الأنشطة والتدريبات.
اصطف المسطرة بشكل متتالٍ عدة مرات.
قرب المسطرة إلى قصاصات الورق دون تدوين ملاحظاتك، وقم بشرحها في كتاب الأنشطة والتدريبات.
قبل ذلك، تأكد أنه لا توجد شحنات كهربائية إضافية على المسطرة.
بعد ذلك، في حال وجود شحنات كهربائية على المسطرة، قد تسبب جذب قصاصات الورق إليها.
الأشياء الصلبة قد تولد كهرباء ساكنة.`, Img:"../../../../assets/images/Screenshot 2024-06-23 013249.png" },
{ title: ' نشاط(3)      التيار الكهربائي', text: `وحدة المستخدمة: كشاف الجيب الكهربائي - الكشاف مع بطارية خاصة.

الخطوات: أدخل البطارية داخل الكشاف. ثم اضغط على زر التشغيل.

يرجى تسجيل ملاحظاتك وشرحك في دفتر الأنشطة والتدريبات.

32 صفحة

البطارية تولد شحنات كهربائية في الأسلاك الموجودة في الكشاف (تُعرف بوصلات كهربائية) وتسير التيارات الكهربائية في اتجاه واحد. ولذا يُعرف بتيار مستمر. الكهرباء الجارية: هي شحنات كهربائية تتحرك عبر أسلاك موصلة على مسافات بعيدة.`, Img:"../../../../assets/images/Screenshot 2024-06-23 013531.png" },
{ title: ' نشاط(4)       اصنع بطاريه من الليمون', text: `المواد المستخدمة: ليمونة (ناضجة) - ساق من النحاس - ساق من الحديد - مصباح مع قاعدة - وصلات توصيل.

الخطوات:

- قشّر الليمونة بعناية حتى تصبح عارية.

أدخل ساق النحاس وساق الحديد بعيدتين بمسافة قصيرة داخل الليمونة (بحوالي 3 سم).

قم بتوصيل الساقين بالمصباح كما في الصورة.

شارك ملاحظاتك واستنتاجاتك في دليل الأنشطة والتمارين صفحة 23.`, Img:"../../../../assets/images/Screenshot 2024-06-23 013824.png" },
{ title: ' نشاط(5)  تكوين دائره كهربائيه', text: `الأدوات المستخدمة: بطارية - مصباح
له قاعدة - أسلاك توصيل أطرافها
الخطوات:
كون الدائرة الكهربية كما هو موضح في الرسم المقابل.
قم بتنفيذ الخطوات الموجودة في كتاب الأنشطة والتدريبات.
وسيساعدك المنزل في إجراء هذه التجربة أو أي نشاط آخر.
ملاحظات في الجداول الموجودة في كتاب الأنشطة والتدريبات.
البطارية مصدر للتيار الكهربائي.
المفتاح يعمل على فتح وغلق الدائرة الكهربائية.
الأسلاك تستخدم في نقل التيار الكهربائي من البطارية إلى المصباح.
الدائرة الكهربائية: مسار مغلق للتيار الكهربي.`, Img:"../../../../assets/images/Screenshot 2024-06-23 014100.png" },

  ]
}
