import { Component } from '@angular/core';
import { ButtonModule } from 'primeng/button';

@Component({
  selector: 'app-first-lesson',
  templateUrl: './first-lesson.component.html',
  styleUrls: ['./first-lesson.component.sass'],
})



export class FirstLessonComponent {

  items= [
    { title: ' نشاط(1)المقصود بالطاقه', text: ' الطاقة: هي القدرة على بذل الجهد. توجد في منازلنا عدة أجهزة تمدنا بصور مختلفة من الطاقة. ', Img:"../../../../assets/images/Screenshot 2024-06-17 155007.png" },
    { title: ' نشاط(2)الاجهزه وصور الطاقه', text: `
    توجد أنواع متعددة من الطاقة:<br>
    <ul>
      <li>طاقة الوضع: كطاقة مخزنة في الزنبركات لدى السيارات اللعبة.</li>
      <li>الطاقة الضوئية: كطاقة مشعة من المصابيح الكهربائية.</li>
      <li>الطاقة الحركية: كطاقة تظهر أثناء حركة المراوح.</li>
      <li>الطاقة الحرارية: كطاقة تشع من المدافئ.</li>
      <li>الطاقة الصوتية: كطاقة تصدرها الآلات الصوتية أثناء عزفها.</li>
      <li>الطاقة الكهربائية: كطاقة ناتجة عن الأعمدة الكهربائية.</li>
    </ul>
    كل هذه الأشكال للطاقة تمتلك القدرة على أداء العمل.
  `, Img:"../../../../assets/images/Screenshot 2024-06-17 155033.png" },
 { title: ' نشاط(3)المقصود بالطاقه الصوتيه', text: `الأدوات المستخدمة: مسطرة خشبية - منضدة.

 . الخطوات:
 
 ثبت طرف المسطرة الخشبية في المنضدة.
 
 اجذب الطرف الآخر إلى أسفل ثم اتركه.
 
 ثم أجب عن السؤال الموجود بكتاب الأنشطة ودون استنتاجك ص 25
 
 اهتزاز المسطرة ينشأ عنه صوت.
 من النشاط السابق نجد أنه:
 
 الصوت صورة من صور الطاقة تصل للأذن فتسبب السمع.`, Img:"../../../../assets/images/Screenshot 2024-06-19 024702.png" },
 { title: ' نشاط(4)  الصوت واهتزاز الاجسام', text: `شوكة رنانة! الخطوات:

 أمسك مقبض الشوكة الرنانة واطرحها على منضدة خشبية.
 قرب فرعي الشوكة من إحدى أذنيه بشرعة.
 اضغط بإصبعك على فرعي الشوكة بعد طرقها.
 إذا طرقت الشوكة، ستحس بالاهتزاز في فرعيها عند لمسهما.
 سجل ملاحظاتك.`, Img:"../../../../assets/images/Screenshot 2024-06-19 030128.png" },
 { title: ' نشاط(5)    تحول طاقه الوضع الي طاقه حركه', text: `أحضر سيارة لعبة تعمل بالزنبرك.

 املأ الزنبرية ثم ضع السيارة على المنضدة.
 عند ملء الزنبرية، يتم تخزين الطاقة بها؛ حيث تتحول إلى طاقة حركية عند تركها حرة، مما يؤدي إلى تحريك السيارة.
 
 يحدث تحول الطاقة من وضعية إلى حركية في زنبرك لعب الأطفال.`, Img:"../../../../assets/images/Screenshot 2024-06-19 030811.png" },

 { title: ' نشاط(6)    تحول طاقه الوضع الي طاقه حركه', text: `بدون تغييرات في الأدوات المستخدمة:

 الأستك - مسماران - قطعة خشب ٣ lal ob) سم) - مطرقة صغيرة.
 الخطوات:
 
 استخدم المطرقة لتثبيت المسامير في القطعة الخشب على بعد د ٢٣٥ سم كما هو موضح في (أ).
 
 ربط طرفي الأستك بالمسامير كما في الشكل ) ب).  اسحب الأستك برفق واستجب للاسئلة الموجودة في كتاب الأنشطة والتدريبات وقم بعمل استنتاجك واستشفافات  - 
 
 يتحول الحركة إلى طاقة صوتية تسمع.`, Img:"../../../../assets/images/Screenshot 2024-06-19 031300.png" },

 { title: ' نشاط(7)    تحول طاقه الحركه الي طاقه حراريه', text: `أعقب على السؤال وسجل استنتاجك في كتاب الأنشطة (صفحة ٧٢).

 ٢٦ - أغسطس - ٢٠١٩ الفصل الثالث
 
 تحول الطاقة الحركية إلى طاقة حرارية كما في ضم اليدين`, Img:"../../../../assets/images/Screenshot 2024-06-19 031659.png" },

 { title: ' نشاط(8)    تحول طاقه الحركه الي طاقه كهربائيه', text: `الأدوات المستخدمة: دراجة متصلة بمصباح كهربائي ودينامو. الخطوات: عند زيادة سرعة الدراجة، تلاحظ زيادة في شدة إضاءة مصباح الدراجة. يوجد جهاز صغير يلامس إطار العجلة يسمى الدينامو، الذي يحول طاقة حركة إطار الدراجة إلى طاقة كهربائية تعمل على إضاءة المصباح. أجب عن السؤال ثم دون استنتاجك في كتاب الأنشطة والتدريبات ص (٧٢). تتحول الطاقة الحركية إلى طاقة كهربائية في الدينامو.

 تحولات الطاقة الكهربائية: تحول الطاقة الكهربائية إلى طاقة ضوئية: عند مرور تيار كهربائي في المصباح، يضيء. تتحول الطاقة الكهربائية إلى طاقة ضوئية في المصباح الكهربائي.`, Img:"../../../../assets/images/imgonline-com-ua-twotoone-oHqtM9BFxi1U.png" },
 { title: ' نشاط(9)    تحول طاقه الكهربيه الي طاقه حركيه', text: `لاحظ الأجهزة الكهربائية الموجودة في منزلك ثم حدد أي منها تعتمد في عملها على تحويل الطاقة الكهربائية إلى طاقة حركية.

 (أو) ابحث وتعلم - العلوم - الصف الرابع الابتدائي الشرو
 
 سجل أسماء هذه الأجهزة في كتاب الأنشطة والتدريبات. ماذا يحدث عند انقطاع التيار الكهربائي؟ سجل إجابتك واستنتاجك في كتاب الأنشطة والتدريبات ص 272 - 280.
 
 تتحول الطاقة الكهربائية إلى طاقة حركية في محرك المروحة.`, Img:"" },
 { title: ' نشاط(10)    تحول طاقه الضوئيه الي طاقه حراريه', text: `الأدوات المستخدمة: عدسة مجمعة - ورقة

 الخطوات:
 
 ضع العدسة أعلى الورقة.
 عرض العدسة لضوء الشمس لفترة من الزمن حتى تكون العدسة مواجهة للورقة.
 دون ملاحظاتك واستنتاجاتك في كتاب الأنشطة والتدريبات صفحة 82.
 تحويل الطاقة الضوئية للشمس إلى طاقة حرارية بواسطة العدسة المكبرة (مجمعة).
 
 تحويل الطاقة الضوئية إلى طاقة كهربائية:
 
 تستخدم الخلايا الشمسية في الحصول على طاقة كهربائية من الطاقة الضوئية. ويُستفاد من ذلك في تزويد الأقمار الصناعية بالطاقة الكهربائية لتشغيل أجهزتها وتوليد الطاقة الكهربائية المستخدمة في المنازل.
 
 تحويل الطاقة الضوئية إلى طاقة كهربائية في الخلايا الشمسية.`, Img:"../../../../assets/images/imgonline-com-ua-twotoone-s8c29y6EMFY9zada.png" },
  
];
}
